rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
/*
** ###################################################################
**     Processor:           S32K37_M7
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32K37 RM Rev.3
**     Version:             rev. 2.0, 2024-03-28
**     Build:               b240328
**
**     Abstract:
**         Peripheral Access Layer for S32K37_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K37_DSPSS.h
 * @version 2.0
 * @date 2024-03-28
 * @brief Peripheral Access Layer for S32K37_DSPSS
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K37_DSPSS_H_)  /* Check if memory map has not been already included */
#define S32K37_DSPSS_H_

#include "S32K37_COMMON.h"

/* ----------------------------------------------------------------------------
   -- DSPSS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DSPSS_Peripheral_Access_Layer DSPSS Peripheral Access Layer
 * @{
 */

/** DSPSS - Size of Registers Arrays */
#define DSPSS_DSPSS_DSP_THREAD_INFO_COUNT         4u

/** DSPSS - Register Layout Typedef */
typedef struct {
  __IO uint32_t DSPSS_SCHEDULER_XMEM_ADDR_TH0;     /**< Thread Start And End Address Location Configuration, offset: 0x0, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_SCHEDULER_XMEM_TH0;          /**< Thread Threshold And Enable, offset: 0x4, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_SCHEDULER_DSP_CFG_TH0;       /**< PC Initial Value, offset: 0x8, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __I  uint32_t DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH0; /**< Current XMEM Write Pointer, offset: 0xC */
  uint8_t RESERVED_0[4];
  __I  uint32_t DSP_SDADC_CURR_READ_PTR0;          /**< Last Scheduled-Request Address, offset: 0x14 */
  uint8_t RESERVED_1[4];
  __IO uint32_t DSP_CORE_BUF_ADDR0;                /**< Start And End Pointers For DSP And Cortex-M7 Core Shared Buffer, offset: 0x1C */
  uint8_t RESERVED_2[8];
  __IO uint32_t DSP_CORE_CURR_RD_PTR0;             /**< Read Pointer In DSP Buffer, offset: 0x28 */
  __IO uint32_t DSP_CORE_CURR_WR_PTR0;             /**< Write Pointer In DSP Buffer, offset: 0x2C */
  __IO uint32_t DMA_READ_ADDR0;                    /**< Reference DMA Read Region, offset: 0x30 */
  uint8_t RESERVED_3[4];
  __IO uint32_t DMA_ERROR_STATUS0;                 /**< DMA Error Status, offset: 0x38 */
  uint8_t RESERVED_4[4];
  __IO uint32_t DMA_WRITE_ADDR0;                   /**< Reference DMA Write Region, offset: 0x40 */
  __IO uint32_t DMA_CURR_WR_PTR0;                  /**< DMA Current Write Pointer, offset: 0x44 */
  __IO uint32_t DMA_CURR_RD_PTR0;                  /**< DMA Current Read Pointer, offset: 0x48 */
  uint8_t RESERVED_5[4];
  __IO uint32_t DSP_TO_DMA_REQUEST_STATUS0;        /**< DMA Request Status, offset: 0x50 */
  __IO uint32_t THREAD_SUSPEND_REQ0;               /**< Thread Suspend Request For Thread Disabling/PCINIT Change, offset: 0x54, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  uint8_t RESERVED_6[4];
  __IO uint32_t DSPSS_DSP_TH_STATUS0;              /**< Thread Status, offset: 0x5C */
  uint8_t RESERVED_7[28];
  __IO uint32_t DSP_CORE_BUFFER_STATUS0;           /**< DSP Core Buffer Status, offset: 0x7C */
  __IO uint32_t DSP_TO_CORE_TRIG_ERR_STATUS0;      /**< DSP To Cortex-M7 Core Error Trigger, offset: 0x80 */
  __I  uint32_t DS_GATE_STATUS_REGISTER0;          /**< DSP Output Control, offset: 0x84 */
  __IO uint32_t DS_GATE_TRIGMUX_REGISTER0;         /**< DSP Trigger To TRIGMUX, offset: 0x88 */
  __IO uint32_t HW_CTRL_DMA_REQ_STOP0;             /**< Stop DMA Request, offset: 0x8C */
  __IO uint32_t DMA_ERROR_CTRL0;                   /**< DMA Error Control, offset: 0x90 */
  __IO uint32_t HW_CTRL_DMA_REQ_RESPONSE0;         /**< Hardware Control Handling for DMA Request And Response, offset: 0x94 */
  uint8_t RESERVED_8[616];
  __IO uint32_t DSPSS_SCHEDULER_XMEM_ADDR_TH1;     /**< Thread Start And End Address Location Configuration, offset: 0x300, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_SCHEDULER_XMEM_TH1;          /**< Thread Threshold And Enable, offset: 0x304, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_SCHEDULER_DSP_CFG_TH1;       /**< PC Initial Value, offset: 0x308, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __I  uint32_t DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH1; /**< Current XMEM Write Pointer, offset: 0x30C */
  uint8_t RESERVED_9[4];
  __I  uint32_t DSP_SDADC_CURR_READ_PTR1;          /**< Last Scheduled-Request Address, offset: 0x314 */
  uint8_t RESERVED_10[4];
  __IO uint32_t DSP_CORE_BUF_ADDR1;                /**< Start And End Pointers For DSP And Cortex-M7 Core Shared Buffer, offset: 0x31C */
  uint8_t RESERVED_11[8];
  __IO uint32_t DSP_CORE_CURR_RD_PTR1;             /**< Read Pointer In DSP Buffer, offset: 0x328 */
  __IO uint32_t DSP_CORE_CURR_WR_PTR1;             /**< Write Pointer In DSP Buffer, offset: 0x32C */
  __IO uint32_t DMA_READ_ADDR1;                    /**< Reference DMA Read Region, offset: 0x330 */
  uint8_t RESERVED_12[4];
  __IO uint32_t DMA_ERROR_STATUS1;                 /**< DMA Error Status, offset: 0x338 */
  uint8_t RESERVED_13[4];
  __IO uint32_t DMA_WRITE_ADDR1;                   /**< Reference DMA Write Region, offset: 0x340 */
  __IO uint32_t DMA_CURR_WR_PTR1;                  /**< DMA Current Write Pointer, offset: 0x344 */
  __IO uint32_t DMA_CURR_RD_PTR1;                  /**< DMA Current Read Pointer, offset: 0x348 */
  uint8_t RESERVED_14[4];
  __IO uint32_t DSP_TO_DMA_REQUEST_STATUS1;        /**< DMA Request Status, offset: 0x350 */
  __IO uint32_t THREAD_SUSPEND_REQ1;               /**< Thread Suspend Request For Thread Disabling/PCINIT Change, offset: 0x354, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  uint8_t RESERVED_15[4];
  __IO uint32_t DSPSS_DSP_TH_STATUS1;              /**< Thread Status, offset: 0x35C */
  uint8_t RESERVED_16[28];
  __IO uint32_t DSP_CORE_BUFFER_STATUS1;           /**< DSP Core Buffer Status, offset: 0x37C */
  __IO uint32_t DSP_TO_CORE_TRIG_ERR_STATUS1;      /**< DSP To Cortex-M7 Core Error Trigger, offset: 0x380 */
  __I  uint32_t DS_GATE_STATUS_REGISTER1;          /**< DSP Output Control, offset: 0x384 */
  __IO uint32_t DS_GATE_TRIGMUX_REGISTER1;         /**< DSP Trigger To TRIGMUX, offset: 0x388 */
  __IO uint32_t HW_CTRL_DMA_REQ_STOP1;             /**< Stop DMA Request, offset: 0x38C */
  __IO uint32_t DMA_ERROR_CTRL1;                   /**< DMA Error Control, offset: 0x390 */
  __IO uint32_t HW_CTRL_DMA_REQ_RESPONSE1;         /**< Hardware Control Handling for DMA Request And Response, offset: 0x394 */
  uint8_t RESERVED_17[616];
  __IO uint32_t DSPSS_SCHEDULER_XMEM_ADDR_TH2;     /**< Thread Start And End Address Location Configuration, offset: 0x600, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_SCHEDULER_XMEM_TH2;          /**< Thread Threshold And Enable, offset: 0x604, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_SCHEDULER_DSP_CFG_TH2;       /**< PC Initial Value, offset: 0x608, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __I  uint32_t DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH2; /**< Current XMEM Write Pointer, offset: 0x60C */
  uint8_t RESERVED_18[4];
  __I  uint32_t DSP_SDADC_CURR_READ_PTR2;          /**< Last Scheduled-Request Address, offset: 0x614 */
  uint8_t RESERVED_19[4];
  __IO uint32_t DSP_CORE_BUF_ADDR2;                /**< Start And End Pointers For DSP And Cortex-M7 Core Shared Buffer, offset: 0x61C */
  uint8_t RESERVED_20[8];
  __IO uint32_t DSP_CORE_CURR_RD_PTR2;             /**< Read Pointer In DSP Buffer, offset: 0x628 */
  __IO uint32_t DSP_CORE_CURR_WR_PTR2;             /**< Write Pointer In DSP Buffer, offset: 0x62C */
  __IO uint32_t DMA_READ_ADDR2;                    /**< Reference DMA Read Region, offset: 0x630 */
  uint8_t RESERVED_21[4];
  __IO uint32_t DMA_ERROR_STATUS2;                 /**< DMA Error Status, offset: 0x638 */
  uint8_t RESERVED_22[4];
  __IO uint32_t DMA_WRITE_ADDR2;                   /**< Reference DMA Write Region, offset: 0x640 */
  __IO uint32_t DMA_CURR_WR_PTR2;                  /**< DMA Current Write Pointer, offset: 0x644 */
  __IO uint32_t DMA_CURR_RD_PTR2;                  /**< DMA Current Read Pointer, offset: 0x648 */
  uint8_t RESERVED_23[4];
  __IO uint32_t DSP_TO_DMA_REQUEST_STATUS2;        /**< DMA Request Status, offset: 0x650 */
  __IO uint32_t THREAD_SUSPEND_REQ2;               /**< Thread Suspend Request For Thread Disabling/PCINIT Change, offset: 0x654, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  uint8_t RESERVED_24[4];
  __IO uint32_t DSPSS_DSP_TH_STATUS2;              /**< Thread Status, offset: 0x65C */
  uint8_t RESERVED_25[28];
  __IO uint32_t DSP_CORE_BUFFER_STATUS2;           /**< DSP Core Buffer Status, offset: 0x67C */
  __IO uint32_t DSP_TO_CORE_TRIG_ERR_STATUS2;      /**< DSP To Cortex-M7 Core Error Trigger, offset: 0x680 */
  __I  uint32_t DS_GATE_STATUS_REGISTER2;          /**< DSP Output Control, offset: 0x684 */
  __IO uint32_t DS_GATE_TRIGMUX_REGISTER2;         /**< DSP Trigger To TRIGMUX, offset: 0x688 */
  __IO uint32_t HW_CTRL_DMA_REQ_STOP2;             /**< Stop DMA Request, offset: 0x68C */
  __IO uint32_t DMA_ERROR_CTRL2;                   /**< DMA Error Control, offset: 0x690 */
  __IO uint32_t HW_CTRL_DMA_REQ_RESPONSE2;         /**< Hardware Control Handling for DMA Request And Response, offset: 0x694 */
  uint8_t RESERVED_26[616];
  __IO uint32_t DSPSS_SCHEDULER_XMEM_ADDR_TH3;     /**< Thread Start And End Address Location Configuration, offset: 0x900, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_SCHEDULER_XMEM_TH3;          /**< Thread Threshold And Enable, offset: 0x904, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_SCHEDULER_DSP_CFG_TH3;       /**< PC Initial Value, offset: 0x908, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __I  uint32_t DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH3; /**< Current XMEM Write Pointer, offset: 0x90C */
  uint8_t RESERVED_27[4];
  __I  uint32_t DSP_SDADC_CURR_READ_PTR3;          /**< Last Scheduled-Request Address, offset: 0x914 */
  uint8_t RESERVED_28[4];
  __IO uint32_t DSP_CORE_BUF_ADDR3;                /**< Start And End Pointers For DSP And Cortex-M7 Core Shared Buffer, offset: 0x91C */
  uint8_t RESERVED_29[8];
  __IO uint32_t DSP_CORE_CURR_RD_PTR3;             /**< Read Pointer In DSP Buffer, offset: 0x928 */
  __IO uint32_t DSP_CORE_CURR_WR_PTR3;             /**< Write Pointer In DSP Buffer, offset: 0x92C */
  __IO uint32_t DMA_READ_ADDR3;                    /**< Reference DMA Read Region, offset: 0x930 */
  uint8_t RESERVED_30[4];
  __IO uint32_t DMA_ERROR_STATUS3;                 /**< DMA Error Status, offset: 0x938 */
  uint8_t RESERVED_31[4];
  __IO uint32_t DMA_WRITE_ADDR3;                   /**< Reference DMA Write Region, offset: 0x940 */
  __IO uint32_t DMA_CURR_WR_PTR3;                  /**< DMA Current Write Pointer, offset: 0x944 */
  __IO uint32_t DMA_CURR_RD_PTR3;                  /**< DMA Current Read Pointer, offset: 0x948 */
  uint8_t RESERVED_32[4];
  __IO uint32_t DSP_TO_DMA_REQUEST_STATUS3;        /**< DMA Request Status, offset: 0x950 */
  __IO uint32_t THREAD_SUSPEND_REQ3;               /**< Thread Suspend Request For Thread Disabling/PCINIT Change, offset: 0x954, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  uint8_t RESERVED_33[4];
  __IO uint32_t DSPSS_DSP_TH_STATUS3;              /**< Thread Status, offset: 0x95C */
  uint8_t RESERVED_34[28];
  __IO uint32_t DSP_CORE_BUFFER_STATUS3;           /**< DSP Core Buffer Status, offset: 0x97C */
  __IO uint32_t DSP_TO_CORE_TRIG_ERR_STATUS3;      /**< DSP To Cortex-M7 Core Error Trigger, offset: 0x980 */
  __I  uint32_t DS_GATE_STATUS_REGISTER3;          /**< DSP Output Control, offset: 0x984 */
  __IO uint32_t DS_GATE_TRIGMUX_REGISTER3;         /**< DSP Trigger To TRIGMUX, offset: 0x988 */
  __IO uint32_t HW_CTRL_DMA_REQ_STOP3;             /**< Stop DMA Request, offset: 0x98C */
  __IO uint32_t DMA_ERROR_CTRL3;                   /**< DMA Error Control, offset: 0x990 */
  __IO uint32_t HW_CTRL_DMA_REQ_RESPONSE3;         /**< Hardware Control Handling for DMA Request And Response, offset: 0x994 */
  uint8_t RESERVED_35[588];
  __IO uint32_t DSPSS_SOFT_RESET_REGISTER;         /**< DSPSS Soft Reset, offset: 0xBE4, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSP_ACK_TIMEOUT_CFG_AND_ERR_CTRL;  /**< DSP ACK Timeout Configuration And Error Control, offset: 0xBE8, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t ECC_ERROR_MONITOR_THREAD_SUSPEND_CTRL; /**< Disable Monitoring of ECC Errors In XMEM And PMEM, offset: 0xBEC, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t INTERRUPT_ENABLE_REGISTER2;        /**< Interrupt Enable, offset: 0xBF0, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t SDADC_SYNC_FIFO_ERROR_STATUS;      /**< FIFO Overflow Status, offset: 0xBF4, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  uint8_t RESERVED_36[4];
  __IO uint32_t DSP_CORE_BUFFER_CFG;               /**< Configuration For DSP-Core Buffer, offset: 0xBFC, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DMA_BUFFER_CFG;                    /**< DMA Buffer Configuration, offset: 0xC00, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t SCHEDULER_MODE_CFG;                /**< Thread Scheduling Mode Selection, offset: 0xC04, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_DSP0_CFG;                    /**< DSP0 Reset And Core Trigger Configuration, offset: 0xC08, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  uint8_t RESERVED_37[4];
  __IO uint32_t INTERRUPT_ENABLE_REGISTER;         /**< Interrupt Enable, offset: 0xC10, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  __IO uint32_t DSPSS_DSP_IO_INTF0;                /**< DSP Trigger to Core, offset: 0xC14 */
  uint8_t RESERVED_38[4];
  __IO uint32_t CURR_ACTIVE_THRD;                  /**< DSP Core Status, offset: 0xC1C, available only on: dspss_0/DSPSS_0 (missing on dspss_1/DSPSS_1) */
  uint8_t RESERVED_39[4];
  __IO uint32_t DSPSS_DSP_CORE_TRIGGER_SAFETY;     /**< >DSP Safety Trigger to Core, offset: 0xC24 */
  uint8_t RESERVED_40[8];
  __IO uint32_t DMA_READ_ADDR4;                    /**< Reference DMA Read Region, offset: 0xC30 */
  uint8_t RESERVED_41[4];
  __IO uint32_t DMA_ERROR_STATUS4;                 /**< DMA Error Status, offset: 0xC38 */
  uint8_t RESERVED_42[4];
  __IO uint32_t DMA_WRITE_ADDR4;                   /**< Reference DMA Write Region, offset: 0xC40 */
  __IO uint32_t DMA_CURR_WR_PTR4;                  /**< DMA Current Write Pointer, offset: 0xC44 */
  __IO uint32_t DMA_CURR_RD_PTR4;                  /**< DMA Current Read Pointer, offset: 0xC48 */
  uint8_t RESERVED_43[4];
  __IO uint32_t DSP_TO_DMA_REQUEST_STATUS4;        /**< DMA Request Status, offset: 0xC50 */
  uint8_t RESERVED_44[56];
  __IO uint32_t HW_CTRL_DMA_REQ_STOP4;             /**< Stop DMA Request, offset: 0xC8C */
  __IO uint32_t DMA_ERROR_CTRL4;                   /**< DMA Error Control, offset: 0xC90 */
  __IO uint32_t HW_CTRL_DMA_REQ_RESPONSE4;         /**< Hardware Control Handling for DMA Request And Response, offset: 0xC94 */
  uint8_t RESERVED_45[664];
  __IO uint32_t DMA_READ_ADDR5;                    /**< Reference DMA Read Region, offset: 0xF30 */
  uint8_t RESERVED_46[4];
  __IO uint32_t DMA_ERROR_STATUS5;                 /**< DMA Error Status, offset: 0xF38 */
  uint8_t RESERVED_47[4];
  __IO uint32_t DMA_WRITE_ADDR5;                   /**< Reference DMA Write Region, offset: 0xF40 */
  __IO uint32_t DMA_CURR_WR_PTR5;                  /**< DMA Current Write Pointer, offset: 0xF44 */
  __IO uint32_t DMA_CURR_RD_PTR5;                  /**< DMA Current Read Pointer, offset: 0xF48 */
  uint8_t RESERVED_48[4];
  __IO uint32_t DSP_TO_DMA_REQUEST_STATUS5;        /**< DMA Request Status, offset: 0xF50 */
  uint8_t RESERVED_49[56];
  __IO uint32_t HW_CTRL_DMA_REQ_STOP5;             /**< Stop DMA Request, offset: 0xF8C */
  __IO uint32_t DMA_ERROR_CTRL5;                   /**< DMA Error Control, offset: 0xF90 */
  __IO uint32_t HW_CTRL_DMA_REQ_RESPONSE5;         /**< Hardware Control Handling for DMA Request And Response, offset: 0xF94 */
  uint8_t RESERVED_50[616];
  __I  uint32_t DSPSS_DSP_THREAD_INFO[DSPSS_DSPSS_DSP_THREAD_INFO_COUNT]; /**< Thread Status Info 0..Thread Status Info 3, array offset: 0x1200, array step: 0x4, available only on: dspss_1/DSPSS_1 (missing on dspss_0/DSPSS_0) */
} DSPSS_Type, *DSPSS_MemMapPtr;

/** Number of instances of the DSPSS module. */
#define DSPSS_INSTANCE_COUNT                     (2u)

/* DSPSS - Peripheral instance base addresses */
/** Peripheral DSPSS_0 base address */
#define IP_DSPSS_0_BASE                          (0x406DC000u)
/** Peripheral DSPSS_0 base pointer */
#define IP_DSPSS_0                               ((DSPSS_Type *)IP_DSPSS_0_BASE)
/** Peripheral DSPSS_1 base address */
#define IP_DSPSS_1_BASE                          (0u)
/** Peripheral DSPSS_1 base pointer */
#define IP_DSPSS_1                               ((DSPSS_Type *)IP_DSPSS_1_BASE)
/** Array initializer of DSPSS peripheral base addresses */
#define IP_DSPSS_BASE_ADDRS                      { IP_DSPSS_0_BASE, IP_DSPSS_1_BASE }
/** Array initializer of DSPSS peripheral base pointers */
#define IP_DSPSS_BASE_PTRS                       { IP_DSPSS_0, IP_DSPSS_1 }

/* ----------------------------------------------------------------------------
   -- DSPSS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DSPSS_Register_Masks DSPSS Register Masks
 * @{
 */

