rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
#define DSPSS_DSP_CORE_CURR_WR_PTR0_DSP_CORE_CURR_WR_PTR_WRAP_MASK (0x4000U)
#define DSPSS_DSP_CORE_CURR_WR_PTR0_DSP_CORE_CURR_WR_PTR_WRAP_SHIFT (14U)
#define DSPSS_DSP_CORE_CURR_WR_PTR0_DSP_CORE_CURR_WR_PTR_WRAP_WIDTH (1U)
#define DSPSS_DSP_CORE_CURR_WR_PTR0_DSP_CORE_CURR_WR_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_WR_PTR0_DSP_CORE_CURR_WR_PTR_WRAP_SHIFT)) & DSPSS_DSP_CORE_CURR_WR_PTR0_DSP_CORE_CURR_WR_PTR_WRAP_MASK)
/*! @} */

/*! @name DMA_READ_ADDR0 - Reference DMA Read Region */
/*! @{ */

#define DSPSS_DMA_READ_ADDR0_DMA_READ_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DMA_READ_ADDR0_DMA_READ_START_ADDR_SHIFT (0U)
#define DSPSS_DMA_READ_ADDR0_DMA_READ_START_ADDR_WIDTH (14U)
#define DSPSS_DMA_READ_ADDR0_DMA_READ_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_READ_ADDR0_DMA_READ_START_ADDR_SHIFT)) & DSPSS_DMA_READ_ADDR0_DMA_READ_START_ADDR_MASK)

#define DSPSS_DMA_READ_ADDR0_DMA_READ_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DMA_READ_ADDR0_DMA_READ_END_ADDR_SHIFT (18U)
#define DSPSS_DMA_READ_ADDR0_DMA_READ_END_ADDR_WIDTH (14U)
#define DSPSS_DMA_READ_ADDR0_DMA_READ_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_READ_ADDR0_DMA_READ_END_ADDR_SHIFT)) & DSPSS_DMA_READ_ADDR0_DMA_READ_END_ADDR_MASK)
/*! @} */

/*! @name DMA_ERROR_STATUS0 - DMA Error Status */
/*! @{ */

#define DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_WR_BUFFER_MASK (0x1U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT (0U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_WR_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_WR_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_WR_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_RD_BUFFER_MASK (0x2U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT (1U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_RD_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_RD_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS0_DMA_ADDR_MISMATCH_RD_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_WRITE_MASK (0x4U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_WRITE_SHIFT (2U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_WRITE_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_WRITE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_WRITE_SHIFT)) & DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_WRITE_MASK)

#define DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_READ_MASK (0x8U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_READ_SHIFT (3U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_READ_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_READ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_READ_SHIFT)) & DSPSS_DMA_ERROR_STATUS0_DMA_XFR_ERR_READ_MASK)
/*! @} */

/*! @name DMA_WRITE_ADDR0 - Reference DMA Write Region */
/*! @{ */

#define DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_START_ADDR_SHIFT (0U)
#define DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_START_ADDR_WIDTH (14U)
#define DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_START_ADDR_SHIFT)) & DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_START_ADDR_MASK)

#define DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_END_ADDR_SHIFT (18U)
#define DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_END_ADDR_WIDTH (14U)
#define DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_END_ADDR_SHIFT)) & DSPSS_DMA_WRITE_ADDR0_DMA_WRITE_END_ADDR_MASK)
/*! @} */

/*! @name DMA_CURR_WR_PTR0 - DMA Current Write Pointer */
/*! @{ */

#define DSPSS_DMA_CURR_WR_PTR0_DMA_CURR_WRITE_PTR_MASK (0x3FFFU)
#define DSPSS_DMA_CURR_WR_PTR0_DMA_CURR_WRITE_PTR_SHIFT (0U)
#define DSPSS_DMA_CURR_WR_PTR0_DMA_CURR_WRITE_PTR_WIDTH (14U)
#define DSPSS_DMA_CURR_WR_PTR0_DMA_CURR_WRITE_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_WR_PTR0_DMA_CURR_WRITE_PTR_SHIFT)) & DSPSS_DMA_CURR_WR_PTR0_DMA_CURR_WRITE_PTR_MASK)

#define DSPSS_DMA_CURR_WR_PTR0_DMA_WRITE_PTR_WRAP_MASK (0x80000000U)
#define DSPSS_DMA_CURR_WR_PTR0_DMA_WRITE_PTR_WRAP_SHIFT (31U)
#define DSPSS_DMA_CURR_WR_PTR0_DMA_WRITE_PTR_WRAP_WIDTH (1U)
#define DSPSS_DMA_CURR_WR_PTR0_DMA_WRITE_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_WR_PTR0_DMA_WRITE_PTR_WRAP_SHIFT)) & DSPSS_DMA_CURR_WR_PTR0_DMA_WRITE_PTR_WRAP_MASK)
/*! @} */

/*! @name DMA_CURR_RD_PTR0 - DMA Current Read Pointer */
/*! @{ */

#define DSPSS_DMA_CURR_RD_PTR0_DMA_CURR_READ_PTR_MASK (0x3FFFU)
#define DSPSS_DMA_CURR_RD_PTR0_DMA_CURR_READ_PTR_SHIFT (0U)
#define DSPSS_DMA_CURR_RD_PTR0_DMA_CURR_READ_PTR_WIDTH (14U)
#define DSPSS_DMA_CURR_RD_PTR0_DMA_CURR_READ_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_RD_PTR0_DMA_CURR_READ_PTR_SHIFT)) & DSPSS_DMA_CURR_RD_PTR0_DMA_CURR_READ_PTR_MASK)

#define DSPSS_DMA_CURR_RD_PTR0_DMA_READ_PTR_WRAP_MASK (0x80000000U)
#define DSPSS_DMA_CURR_RD_PTR0_DMA_READ_PTR_WRAP_SHIFT (31U)
#define DSPSS_DMA_CURR_RD_PTR0_DMA_READ_PTR_WRAP_WIDTH (1U)
#define DSPSS_DMA_CURR_RD_PTR0_DMA_READ_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_RD_PTR0_DMA_READ_PTR_WRAP_SHIFT)) & DSPSS_DMA_CURR_RD_PTR0_DMA_READ_PTR_WRAP_MASK)
/*! @} */

/*! @name DSP_TO_DMA_REQUEST_STATUS0 - DMA Request Status */
/*! @{ */

#define DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DSP_TO_DMA_REQUEST_STATUS_MASK (0x1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DSP_TO_DMA_REQUEST_STATUS_SHIFT (0U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DSP_TO_DMA_REQUEST_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DSP_TO_DMA_REQUEST_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DSP_TO_DMA_REQUEST_STATUS_SHIFT)) & DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DSP_TO_DMA_REQUEST_STATUS_MASK)

#define DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DMA_TO_DSP_ACK_STATUS_MASK (0x2U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DMA_TO_DSP_ACK_STATUS_SHIFT (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DMA_TO_DSP_ACK_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DMA_TO_DSP_ACK_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DMA_TO_DSP_ACK_STATUS_SHIFT)) & DSPSS_DSP_TO_DMA_REQUEST_STATUS0_DMA_TO_DSP_ACK_STATUS_MASK)
/*! @} */

/*! @name THREAD_SUSPEND_REQ0 - Thread Suspend Request For Thread Disabling/PCINIT Change */
/*! @{ */

#define DSPSS_THREAD_SUSPEND_REQ0_SUSPEND_REQ_MASK (0x1U)
#define DSPSS_THREAD_SUSPEND_REQ0_SUSPEND_REQ_SHIFT (0U)
#define DSPSS_THREAD_SUSPEND_REQ0_SUSPEND_REQ_WIDTH (1U)
#define DSPSS_THREAD_SUSPEND_REQ0_SUSPEND_REQ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_THREAD_SUSPEND_REQ0_SUSPEND_REQ_SHIFT)) & DSPSS_THREAD_SUSPEND_REQ0_SUSPEND_REQ_MASK)
/*! @} */

/*! @name DSPSS_DSP_TH_STATUS0 - Thread Status */
/*! @{ */

#define DSPSS_DSPSS_DSP_TH_STATUS0_dspss_th_suspended_MASK (0x1U)
#define DSPSS_DSPSS_DSP_TH_STATUS0_dspss_th_suspended_SHIFT (0U)
#define DSPSS_DSPSS_DSP_TH_STATUS0_dspss_th_suspended_WIDTH (1U)
#define DSPSS_DSPSS_DSP_TH_STATUS0_dspss_th_suspended(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_TH_STATUS0_dspss_th_suspended_SHIFT)) & DSPSS_DSPSS_DSP_TH_STATUS0_dspss_th_suspended_MASK)
/*! @} */

/*! @name DSP_CORE_BUFFER_STATUS0 - DSP Core Buffer Status */
/*! @{ */

#define DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_OVF_MASK (0x2U)
#define DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_OVF_SHIFT (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_OVF_WIDTH (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_OVF(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_OVF_SHIFT)) & DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_OVF_MASK)

#define DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_UNDF_MASK (0x4U)
#define DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_UNDF_SHIFT (2U)
#define DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_UNDF_WIDTH (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_UNDF(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_UNDF_SHIFT)) & DSPSS_DSP_CORE_BUFFER_STATUS0_DSP_CORE_BUFFER_UNDF_MASK)
/*! @} */

/*! @name DSP_TO_CORE_TRIG_ERR_STATUS0 - DSP To Cortex-M7 Core Error Trigger */
/*! @{ */

#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS0_DSP_TO_CORE_TRIG_ERR_STATUS_MASK (0x1U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS0_DSP_TO_CORE_TRIG_ERR_STATUS_SHIFT (0U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS0_DSP_TO_CORE_TRIG_ERR_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS0_DSP_TO_CORE_TRIG_ERR_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS0_DSP_TO_CORE_TRIG_ERR_STATUS_SHIFT)) & DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS0_DSP_TO_CORE_TRIG_ERR_STATUS_MASK)
/*! @} */

/*! @name DS_GATE_STATUS_REGISTER0 - DSP Output Control */
/*! @{ */

