rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
#define DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH1_DSPSS_SCHEDULER_CURR_XMEM_ADDR_MASK (0x7FFFU)
#define DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH1_DSPSS_SCHEDULER_CURR_XMEM_ADDR_SHIFT (0U)
#define DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH1_DSPSS_SCHEDULER_CURR_XMEM_ADDR_WIDTH (15U)
#define DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH1_DSPSS_SCHEDULER_CURR_XMEM_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH1_DSPSS_SCHEDULER_CURR_XMEM_ADDR_SHIFT)) & DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH1_DSPSS_SCHEDULER_CURR_XMEM_ADDR_MASK)
/*! @} */

/*! @name DSP_SDADC_CURR_READ_PTR1 - Last Scheduled-Request Address */
/*! @{ */

#define DSPSS_DSP_SDADC_CURR_READ_PTR1_DSP_SDADC_CURR_READ_PTR_MASK (0x3FFFU)
#define DSPSS_DSP_SDADC_CURR_READ_PTR1_DSP_SDADC_CURR_READ_PTR_SHIFT (0U)
#define DSPSS_DSP_SDADC_CURR_READ_PTR1_DSP_SDADC_CURR_READ_PTR_WIDTH (14U)
#define DSPSS_DSP_SDADC_CURR_READ_PTR1_DSP_SDADC_CURR_READ_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_SDADC_CURR_READ_PTR1_DSP_SDADC_CURR_READ_PTR_SHIFT)) & DSPSS_DSP_SDADC_CURR_READ_PTR1_DSP_SDADC_CURR_READ_PTR_MASK)
/*! @} */

/*! @name DSP_CORE_BUF_ADDR1 - Start And End Pointers For DSP And Cortex-M7 Core Shared Buffer */
/*! @{ */

#define DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_START_ADDR_SHIFT (0U)
#define DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_START_ADDR_WIDTH (14U)
#define DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_START_ADDR_SHIFT)) & DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_START_ADDR_MASK)

#define DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_END_ADDR_SHIFT (18U)
#define DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_END_ADDR_WIDTH (14U)
#define DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_END_ADDR_SHIFT)) & DSPSS_DSP_CORE_BUF_ADDR1_DSP_CORE_BUF_END_ADDR_MASK)
/*! @} */

/*! @name DSP_CORE_CURR_RD_PTR1 - Read Pointer In DSP Buffer */
/*! @{ */

#define DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_MASK (0x3FFFU)
#define DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_SHIFT (0U)
#define DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_WIDTH (14U)
#define DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_SHIFT)) & DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_MASK)

#define DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_WRAP_MASK (0x4000U)
#define DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_WRAP_SHIFT (14U)
#define DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_WRAP_WIDTH (1U)
#define DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_WRAP_SHIFT)) & DSPSS_DSP_CORE_CURR_RD_PTR1_DSP_CORE_CURR_RD_PTR_WRAP_MASK)
/*! @} */

/*! @name DSP_CORE_CURR_WR_PTR1 - Write Pointer In DSP Buffer */
/*! @{ */

#define DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_MASK (0x3FFFU)
#define DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_SHIFT (0U)
#define DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_WIDTH (14U)
#define DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_SHIFT)) & DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_MASK)

#define DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_WRAP_MASK (0x4000U)
#define DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_WRAP_SHIFT (14U)
#define DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_WRAP_WIDTH (1U)
#define DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_WRAP_SHIFT)) & DSPSS_DSP_CORE_CURR_WR_PTR1_DSP_CORE_CURR_WR_PTR_WRAP_MASK)
/*! @} */

/*! @name DMA_READ_ADDR1 - Reference DMA Read Region */
/*! @{ */

#define DSPSS_DMA_READ_ADDR1_DMA_READ_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DMA_READ_ADDR1_DMA_READ_START_ADDR_SHIFT (0U)
#define DSPSS_DMA_READ_ADDR1_DMA_READ_START_ADDR_WIDTH (14U)
#define DSPSS_DMA_READ_ADDR1_DMA_READ_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_READ_ADDR1_DMA_READ_START_ADDR_SHIFT)) & DSPSS_DMA_READ_ADDR1_DMA_READ_START_ADDR_MASK)

#define DSPSS_DMA_READ_ADDR1_DMA_READ_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DMA_READ_ADDR1_DMA_READ_END_ADDR_SHIFT (18U)
#define DSPSS_DMA_READ_ADDR1_DMA_READ_END_ADDR_WIDTH (14U)
#define DSPSS_DMA_READ_ADDR1_DMA_READ_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_READ_ADDR1_DMA_READ_END_ADDR_SHIFT)) & DSPSS_DMA_READ_ADDR1_DMA_READ_END_ADDR_MASK)
/*! @} */

/*! @name DMA_ERROR_STATUS1 - DMA Error Status */
/*! @{ */

#define DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_WR_BUFFER_MASK (0x1U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT (0U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_WR_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_WR_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_WR_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_RD_BUFFER_MASK (0x2U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT (1U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_RD_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_RD_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS1_DMA_ADDR_MISMATCH_RD_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS1_DMA_XFR_ERR_WRITE_MASK (0x4U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_XFR_ERR_WRITE_SHIFT (2U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_XFR_ERR_WRITE_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS1_DMA_XFR_ERR_WRITE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS1_DMA_XFR_ERR_WRITE_SHIFT)) & DSPSS_DMA_ERROR_STATUS1_DMA_XFR_ERR_WRITE_MASK)

