rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
/*! @name DS_GATE_STATUS_REGISTER1 - DSP Output Control */
/*! @{ */

#define DSPSS_DS_GATE_STATUS_REGISTER1_DS_GATE_STATUS_REGISTER_MASK (0x1U)
#define DSPSS_DS_GATE_STATUS_REGISTER1_DS_GATE_STATUS_REGISTER_SHIFT (0U)
#define DSPSS_DS_GATE_STATUS_REGISTER1_DS_GATE_STATUS_REGISTER_WIDTH (1U)
#define DSPSS_DS_GATE_STATUS_REGISTER1_DS_GATE_STATUS_REGISTER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DS_GATE_STATUS_REGISTER1_DS_GATE_STATUS_REGISTER_SHIFT)) & DSPSS_DS_GATE_STATUS_REGISTER1_DS_GATE_STATUS_REGISTER_MASK)
/*! @} */

/*! @name DS_GATE_TRIGMUX_REGISTER1 - DSP Trigger To TRIGMUX */
/*! @{ */

#define DSPSS_DS_GATE_TRIGMUX_REGISTER1_DS_GATE_TRIGMUX_TRIGGER_MASK (0x1U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER1_DS_GATE_TRIGMUX_TRIGGER_SHIFT (0U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER1_DS_GATE_TRIGMUX_TRIGGER_WIDTH (1U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER1_DS_GATE_TRIGMUX_TRIGGER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DS_GATE_TRIGMUX_REGISTER1_DS_GATE_TRIGMUX_TRIGGER_SHIFT)) & DSPSS_DS_GATE_TRIGMUX_REGISTER1_DS_GATE_TRIGMUX_TRIGGER_MASK)
/*! @} */

/*! @name HW_CTRL_DMA_REQ_STOP1 - Stop DMA Request */
/*! @{ */

#define DSPSS_HW_CTRL_DMA_REQ_STOP1_STOP_MASK    (0x1U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP1_STOP_SHIFT   (0U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP1_STOP_WIDTH   (1U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP1_STOP(x)      (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_STOP1_STOP_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_STOP1_STOP_MASK)
/*! @} */

/*! @name DMA_ERROR_CTRL1 - DMA Error Control */
/*! @{ */

#define DSPSS_DMA_ERROR_CTRL1_DONE_MASK          (0x1U)
#define DSPSS_DMA_ERROR_CTRL1_DONE_SHIFT         (0U)
#define DSPSS_DMA_ERROR_CTRL1_DONE_WIDTH         (1U)
#define DSPSS_DMA_ERROR_CTRL1_DONE(x)            (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_CTRL1_DONE_SHIFT)) & DSPSS_DMA_ERROR_CTRL1_DONE_MASK)
/*! @} */

/*! @name HW_CTRL_DMA_REQ_RESPONSE1 - Hardware Control Handling for DMA Request And Response */
/*! @{ */

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_START_MASK (0x1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_START_SHIFT (0U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_START_WIDTH (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_START(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_START_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_START_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_MASK (0x1FEU)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_SHIFT (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_WIDTH (8U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_DONE_MASK (0x200U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_DONE_SHIFT (9U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_DONE_WIDTH (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_DONE(x)  (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_DONE_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_DONE_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_PEND_MASK (0x3FC00U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_PEND_SHIFT (10U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_PEND_WIDTH (8U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_PEND(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_PEND_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE1_NUM_OF_DMA_REQ_PEND_MASK)
/*! @} */

/*! @name DSPSS_SCHEDULER_XMEM_ADDR_TH2 - Thread Start And End Address Location Configuration */
/*! @{ */

#define DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_START_ADDR_MASK (0xFFFFU)
#define DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_START_ADDR_SHIFT (0U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_START_ADDR_WIDTH (16U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_START_ADDR_SHIFT)) & DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_START_ADDR_MASK)

#define DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_END_ADDR_MASK (0xFFFF0000U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_END_ADDR_SHIFT (16U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_END_ADDR_WIDTH (16U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_END_ADDR_SHIFT)) & DSPSS_DSPSS_SCHEDULER_XMEM_ADDR_TH2_SCHEDULER_THRD_END_ADDR_MASK)
/*! @} */

/*! @name DSPSS_SCHEDULER_XMEM_TH2 - Thread Threshold And Enable */
/*! @{ */

#define DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_TH_MASK (0xFFFFU)
#define DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_TH_SHIFT (0U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_TH_WIDTH (16U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_TH(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_TH_SHIFT)) & DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_TH_MASK)

#define DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_EN_MASK (0x80000000U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_EN_SHIFT (31U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_EN_WIDTH (1U)
#define DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_EN_SHIFT)) & DSPSS_DSPSS_SCHEDULER_XMEM_TH2_SCHEDULER_THRD_EN_MASK)
/*! @} */

/*! @name DSPSS_SCHEDULER_DSP_CFG_TH2 - PC Initial Value */
/*! @{ */

#define DSPSS_DSPSS_SCHEDULER_DSP_CFG_TH2_DSPSS_SCHEDULER_DSP_PCINIT_MASK (0x3FFFU)
#define DSPSS_DSPSS_SCHEDULER_DSP_CFG_TH2_DSPSS_SCHEDULER_DSP_PCINIT_SHIFT (0U)
#define DSPSS_DSPSS_SCHEDULER_DSP_CFG_TH2_DSPSS_SCHEDULER_DSP_PCINIT_WIDTH (14U)
#define DSPSS_DSPSS_SCHEDULER_DSP_CFG_TH2_DSPSS_SCHEDULER_DSP_PCINIT(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_SCHEDULER_DSP_CFG_TH2_DSPSS_SCHEDULER_DSP_PCINIT_SHIFT)) & DSPSS_DSPSS_SCHEDULER_DSP_CFG_TH2_DSPSS_SCHEDULER_DSP_PCINIT_MASK)
/*! @} */

/*! @name DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH2 - Current XMEM Write Pointer */
/*! @{ */

#define DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH2_DSPSS_SCHEDULER_CURR_XMEM_ADDR_MASK (0x7FFFU)
#define DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH2_DSPSS_SCHEDULER_CURR_XMEM_ADDR_SHIFT (0U)
#define DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH2_DSPSS_SCHEDULER_CURR_XMEM_ADDR_WIDTH (15U)
#define DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH2_DSPSS_SCHEDULER_CURR_XMEM_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH2_DSPSS_SCHEDULER_CURR_XMEM_ADDR_SHIFT)) & DSPSS_DSPSS_SCHEDULER_CURR_XMEM_ADDR_TH2_DSPSS_SCHEDULER_CURR_XMEM_ADDR_MASK)
/*! @} */

/*! @name DSP_SDADC_CURR_READ_PTR2 - Last Scheduled-Request Address */
/*! @{ */

#define DSPSS_DSP_SDADC_CURR_READ_PTR2_DSP_SDADC_CURR_READ_PTR_MASK (0x3FFFU)
#define DSPSS_DSP_SDADC_CURR_READ_PTR2_DSP_SDADC_CURR_READ_PTR_SHIFT (0U)
#define DSPSS_DSP_SDADC_CURR_READ_PTR2_DSP_SDADC_CURR_READ_PTR_WIDTH (14U)
#define DSPSS_DSP_SDADC_CURR_READ_PTR2_DSP_SDADC_CURR_READ_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_SDADC_CURR_READ_PTR2_DSP_SDADC_CURR_READ_PTR_SHIFT)) & DSPSS_DSP_SDADC_CURR_READ_PTR2_DSP_SDADC_CURR_READ_PTR_MASK)
/*! @} */

/*! @name DSP_CORE_BUF_ADDR2 - Start And End Pointers For DSP And Cortex-M7 Core Shared Buffer */
/*! @{ */

