rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
#define DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_START_ADDR_SHIFT (0U)
#define DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_START_ADDR_WIDTH (14U)
#define DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_START_ADDR_SHIFT)) & DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_START_ADDR_MASK)

#define DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_END_ADDR_SHIFT (18U)
#define DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_END_ADDR_WIDTH (14U)
#define DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_END_ADDR_SHIFT)) & DSPSS_DSP_CORE_BUF_ADDR2_DSP_CORE_BUF_END_ADDR_MASK)
/*! @} */

/*! @name DSP_CORE_CURR_RD_PTR2 - Read Pointer In DSP Buffer */
/*! @{ */

#define DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_MASK (0x3FFFU)
#define DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_SHIFT (0U)
#define DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_WIDTH (14U)
#define DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_SHIFT)) & DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_MASK)

#define DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_WRAP_MASK (0x4000U)
#define DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_WRAP_SHIFT (14U)
#define DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_WRAP_WIDTH (1U)
#define DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_WRAP_SHIFT)) & DSPSS_DSP_CORE_CURR_RD_PTR2_DSP_CORE_CURR_RD_PTR_WRAP_MASK)
/*! @} */

/*! @name DSP_CORE_CURR_WR_PTR2 - Write Pointer In DSP Buffer */
/*! @{ */

#define DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_MASK (0x3FFFU)
#define DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_SHIFT (0U)
#define DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_WIDTH (14U)
#define DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_SHIFT)) & DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_MASK)

#define DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_WRAP_MASK (0x4000U)
#define DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_WRAP_SHIFT (14U)
#define DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_WRAP_WIDTH (1U)
#define DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_WRAP_SHIFT)) & DSPSS_DSP_CORE_CURR_WR_PTR2_DSP_CORE_CURR_WR_PTR_WRAP_MASK)
/*! @} */

/*! @name DMA_READ_ADDR2 - Reference DMA Read Region */
/*! @{ */

#define DSPSS_DMA_READ_ADDR2_DMA_READ_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DMA_READ_ADDR2_DMA_READ_START_ADDR_SHIFT (0U)
#define DSPSS_DMA_READ_ADDR2_DMA_READ_START_ADDR_WIDTH (14U)
#define DSPSS_DMA_READ_ADDR2_DMA_READ_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_READ_ADDR2_DMA_READ_START_ADDR_SHIFT)) & DSPSS_DMA_READ_ADDR2_DMA_READ_START_ADDR_MASK)

#define DSPSS_DMA_READ_ADDR2_DMA_READ_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DMA_READ_ADDR2_DMA_READ_END_ADDR_SHIFT (18U)
#define DSPSS_DMA_READ_ADDR2_DMA_READ_END_ADDR_WIDTH (14U)
#define DSPSS_DMA_READ_ADDR2_DMA_READ_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_READ_ADDR2_DMA_READ_END_ADDR_SHIFT)) & DSPSS_DMA_READ_ADDR2_DMA_READ_END_ADDR_MASK)
/*! @} */

/*! @name DMA_ERROR_STATUS2 - DMA Error Status */
/*! @{ */

#define DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_WR_BUFFER_MASK (0x1U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT (0U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_WR_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_WR_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_WR_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_RD_BUFFER_MASK (0x2U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT (1U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_RD_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_RD_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS2_DMA_ADDR_MISMATCH_RD_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_WRITE_MASK (0x4U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_WRITE_SHIFT (2U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_WRITE_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_WRITE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_WRITE_SHIFT)) & DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_WRITE_MASK)

#define DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_READ_MASK (0x8U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_READ_SHIFT (3U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_READ_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_READ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_READ_SHIFT)) & DSPSS_DMA_ERROR_STATUS2_DMA_XFR_ERR_READ_MASK)
/*! @} */

/*! @name DMA_WRITE_ADDR2 - Reference DMA Write Region */
/*! @{ */

#define DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_START_ADDR_SHIFT (0U)
#define DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_START_ADDR_WIDTH (14U)
#define DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_START_ADDR_SHIFT)) & DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_START_ADDR_MASK)

#define DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_END_ADDR_SHIFT (18U)
#define DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_END_ADDR_WIDTH (14U)
#define DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_END_ADDR_SHIFT)) & DSPSS_DMA_WRITE_ADDR2_DMA_WRITE_END_ADDR_MASK)
/*! @} */

/*! @name DMA_CURR_WR_PTR2 - DMA Current Write Pointer */
/*! @{ */

#define DSPSS_DMA_CURR_WR_PTR2_DMA_CURR_WRITE_PTR_MASK (0x3FFFU)
#define DSPSS_DMA_CURR_WR_PTR2_DMA_CURR_WRITE_PTR_SHIFT (0U)
#define DSPSS_DMA_CURR_WR_PTR2_DMA_CURR_WRITE_PTR_WIDTH (14U)
#define DSPSS_DMA_CURR_WR_PTR2_DMA_CURR_WRITE_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_WR_PTR2_DMA_CURR_WRITE_PTR_SHIFT)) & DSPSS_DMA_CURR_WR_PTR2_DMA_CURR_WRITE_PTR_MASK)

#define DSPSS_DMA_CURR_WR_PTR2_DMA_WRITE_PTR_WRAP_MASK (0x80000000U)
#define DSPSS_DMA_CURR_WR_PTR2_DMA_WRITE_PTR_WRAP_SHIFT (31U)
#define DSPSS_DMA_CURR_WR_PTR2_DMA_WRITE_PTR_WRAP_WIDTH (1U)
#define DSPSS_DMA_CURR_WR_PTR2_DMA_WRITE_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_WR_PTR2_DMA_WRITE_PTR_WRAP_SHIFT)) & DSPSS_DMA_CURR_WR_PTR2_DMA_WRITE_PTR_WRAP_MASK)
/*! @} */

/*! @name DMA_CURR_RD_PTR2 - DMA Current Read Pointer */
/*! @{ */

#define DSPSS_DMA_CURR_RD_PTR2_DMA_CURR_READ_PTR_MASK (0x3FFFU)
#define DSPSS_DMA_CURR_RD_PTR2_DMA_CURR_READ_PTR_SHIFT (0U)
#define DSPSS_DMA_CURR_RD_PTR2_DMA_CURR_READ_PTR_WIDTH (14U)
#define DSPSS_DMA_CURR_RD_PTR2_DMA_CURR_READ_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_RD_PTR2_DMA_CURR_READ_PTR_SHIFT)) & DSPSS_DMA_CURR_RD_PTR2_DMA_CURR_READ_PTR_MASK)

#define DSPSS_DMA_CURR_RD_PTR2_DMA_READ_PTR_WRAP_MASK (0x80000000U)
#define DSPSS_DMA_CURR_RD_PTR2_DMA_READ_PTR_WRAP_SHIFT (31U)
#define DSPSS_DMA_CURR_RD_PTR2_DMA_READ_PTR_WRAP_WIDTH (1U)
#define DSPSS_DMA_CURR_RD_PTR2_DMA_READ_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_RD_PTR2_DMA_READ_PTR_WRAP_SHIFT)) & DSPSS_DMA_CURR_RD_PTR2_DMA_READ_PTR_WRAP_MASK)
/*! @} */

/*! @name DSP_TO_DMA_REQUEST_STATUS2 - DMA Request Status */
/*! @{ */

