rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DSP_TO_DMA_REQUEST_STATUS_MASK (0x1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DSP_TO_DMA_REQUEST_STATUS_SHIFT (0U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DSP_TO_DMA_REQUEST_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DSP_TO_DMA_REQUEST_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DSP_TO_DMA_REQUEST_STATUS_SHIFT)) & DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DSP_TO_DMA_REQUEST_STATUS_MASK)

#define DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DMA_TO_DSP_ACK_STATUS_MASK (0x2U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DMA_TO_DSP_ACK_STATUS_SHIFT (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DMA_TO_DSP_ACK_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DMA_TO_DSP_ACK_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DMA_TO_DSP_ACK_STATUS_SHIFT)) & DSPSS_DSP_TO_DMA_REQUEST_STATUS2_DMA_TO_DSP_ACK_STATUS_MASK)
/*! @} */

/*! @name THREAD_SUSPEND_REQ2 - Thread Suspend Request For Thread Disabling/PCINIT Change */
/*! @{ */

#define DSPSS_THREAD_SUSPEND_REQ2_SUSPEND_REQ_MASK (0x1U)
#define DSPSS_THREAD_SUSPEND_REQ2_SUSPEND_REQ_SHIFT (0U)
#define DSPSS_THREAD_SUSPEND_REQ2_SUSPEND_REQ_WIDTH (1U)
#define DSPSS_THREAD_SUSPEND_REQ2_SUSPEND_REQ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_THREAD_SUSPEND_REQ2_SUSPEND_REQ_SHIFT)) & DSPSS_THREAD_SUSPEND_REQ2_SUSPEND_REQ_MASK)
/*! @} */

/*! @name DSPSS_DSP_TH_STATUS2 - Thread Status */
/*! @{ */

#define DSPSS_DSPSS_DSP_TH_STATUS2_dspss_th_suspended_MASK (0x1U)
#define DSPSS_DSPSS_DSP_TH_STATUS2_dspss_th_suspended_SHIFT (0U)
#define DSPSS_DSPSS_DSP_TH_STATUS2_dspss_th_suspended_WIDTH (1U)
#define DSPSS_DSPSS_DSP_TH_STATUS2_dspss_th_suspended(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_TH_STATUS2_dspss_th_suspended_SHIFT)) & DSPSS_DSPSS_DSP_TH_STATUS2_dspss_th_suspended_MASK)
/*! @} */

/*! @name DSP_CORE_BUFFER_STATUS2 - DSP Core Buffer Status */
/*! @{ */

#define DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_OVF_MASK (0x2U)
#define DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_OVF_SHIFT (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_OVF_WIDTH (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_OVF(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_OVF_SHIFT)) & DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_OVF_MASK)

#define DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_UNDF_MASK (0x4U)
#define DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_UNDF_SHIFT (2U)
#define DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_UNDF_WIDTH (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_UNDF(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_UNDF_SHIFT)) & DSPSS_DSP_CORE_BUFFER_STATUS2_DSP_CORE_BUFFER_UNDF_MASK)
/*! @} */

/*! @name DSP_TO_CORE_TRIG_ERR_STATUS2 - DSP To Cortex-M7 Core Error Trigger */
/*! @{ */

#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS2_DSP_TO_CORE_TRIG_ERR_STATUS_MASK (0x1U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS2_DSP_TO_CORE_TRIG_ERR_STATUS_SHIFT (0U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS2_DSP_TO_CORE_TRIG_ERR_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS2_DSP_TO_CORE_TRIG_ERR_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS2_DSP_TO_CORE_TRIG_ERR_STATUS_SHIFT)) & DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS2_DSP_TO_CORE_TRIG_ERR_STATUS_MASK)
/*! @} */

/*! @name DS_GATE_STATUS_REGISTER2 - DSP Output Control */
/*! @{ */

#define DSPSS_DS_GATE_STATUS_REGISTER2_DS_GATE_STATUS_REGISTER_MASK (0x1U)
#define DSPSS_DS_GATE_STATUS_REGISTER2_DS_GATE_STATUS_REGISTER_SHIFT (0U)
#define DSPSS_DS_GATE_STATUS_REGISTER2_DS_GATE_STATUS_REGISTER_WIDTH (1U)
#define DSPSS_DS_GATE_STATUS_REGISTER2_DS_GATE_STATUS_REGISTER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DS_GATE_STATUS_REGISTER2_DS_GATE_STATUS_REGISTER_SHIFT)) & DSPSS_DS_GATE_STATUS_REGISTER2_DS_GATE_STATUS_REGISTER_MASK)
/*! @} */

/*! @name DS_GATE_TRIGMUX_REGISTER2 - DSP Trigger To TRIGMUX */
/*! @{ */

#define DSPSS_DS_GATE_TRIGMUX_REGISTER2_DS_GATE_TRIGMUX_TRIGGER_MASK (0x1U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER2_DS_GATE_TRIGMUX_TRIGGER_SHIFT (0U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER2_DS_GATE_TRIGMUX_TRIGGER_WIDTH (1U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER2_DS_GATE_TRIGMUX_TRIGGER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DS_GATE_TRIGMUX_REGISTER2_DS_GATE_TRIGMUX_TRIGGER_SHIFT)) & DSPSS_DS_GATE_TRIGMUX_REGISTER2_DS_GATE_TRIGMUX_TRIGGER_MASK)
/*! @} */

/*! @name HW_CTRL_DMA_REQ_STOP2 - Stop DMA Request */
/*! @{ */

#define DSPSS_HW_CTRL_DMA_REQ_STOP2_STOP_MASK    (0x1U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP2_STOP_SHIFT   (0U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP2_STOP_WIDTH   (1U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP2_STOP(x)      (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_STOP2_STOP_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_STOP2_STOP_MASK)
/*! @} */

/*! @name DMA_ERROR_CTRL2 - DMA Error Control */
/*! @{ */

#define DSPSS_DMA_ERROR_CTRL2_DONE_MASK          (0x1U)
#define DSPSS_DMA_ERROR_CTRL2_DONE_SHIFT         (0U)
#define DSPSS_DMA_ERROR_CTRL2_DONE_WIDTH         (1U)
#define DSPSS_DMA_ERROR_CTRL2_DONE(x)            (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_CTRL2_DONE_SHIFT)) & DSPSS_DMA_ERROR_CTRL2_DONE_MASK)
/*! @} */

/*! @name HW_CTRL_DMA_REQ_RESPONSE2 - Hardware Control Handling for DMA Request And Response */
/*! @{ */

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_START_MASK (0x1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_START_SHIFT (0U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_START_WIDTH (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_START(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_START_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_START_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_NUM_OF_DMA_REQ_MASK (0x1FEU)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_NUM_OF_DMA_REQ_SHIFT (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_NUM_OF_DMA_REQ_WIDTH (8U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_NUM_OF_DMA_REQ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_NUM_OF_DMA_REQ_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE2_NUM_OF_DMA_REQ_MASK)

