rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
#define DSPSS_THREAD_SUSPEND_REQ3_SUSPEND_REQ_MASK (0x1U)
#define DSPSS_THREAD_SUSPEND_REQ3_SUSPEND_REQ_SHIFT (0U)
#define DSPSS_THREAD_SUSPEND_REQ3_SUSPEND_REQ_WIDTH (1U)
#define DSPSS_THREAD_SUSPEND_REQ3_SUSPEND_REQ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_THREAD_SUSPEND_REQ3_SUSPEND_REQ_SHIFT)) & DSPSS_THREAD_SUSPEND_REQ3_SUSPEND_REQ_MASK)
/*! @} */

/*! @name DSPSS_DSP_TH_STATUS3 - Thread Status */
/*! @{ */

#define DSPSS_DSPSS_DSP_TH_STATUS3_dspss_th_suspended_MASK (0x1U)
#define DSPSS_DSPSS_DSP_TH_STATUS3_dspss_th_suspended_SHIFT (0U)
#define DSPSS_DSPSS_DSP_TH_STATUS3_dspss_th_suspended_WIDTH (1U)
#define DSPSS_DSPSS_DSP_TH_STATUS3_dspss_th_suspended(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP_TH_STATUS3_dspss_th_suspended_SHIFT)) & DSPSS_DSPSS_DSP_TH_STATUS3_dspss_th_suspended_MASK)
/*! @} */

/*! @name DSP_CORE_BUFFER_STATUS3 - DSP Core Buffer Status */
/*! @{ */

#define DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_OVF_MASK (0x2U)
#define DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_OVF_SHIFT (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_OVF_WIDTH (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_OVF(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_OVF_SHIFT)) & DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_OVF_MASK)

#define DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_UNDF_MASK (0x4U)
#define DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_UNDF_SHIFT (2U)
#define DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_UNDF_WIDTH (1U)
#define DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_UNDF(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_UNDF_SHIFT)) & DSPSS_DSP_CORE_BUFFER_STATUS3_DSP_CORE_BUFFER_UNDF_MASK)
/*! @} */

/*! @name DSP_TO_CORE_TRIG_ERR_STATUS3 - DSP To Cortex-M7 Core Error Trigger */
/*! @{ */

#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS3_DSP_TO_CORE_TRIG_ERR_STATUS_MASK (0x1U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS3_DSP_TO_CORE_TRIG_ERR_STATUS_SHIFT (0U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS3_DSP_TO_CORE_TRIG_ERR_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS3_DSP_TO_CORE_TRIG_ERR_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS3_DSP_TO_CORE_TRIG_ERR_STATUS_SHIFT)) & DSPSS_DSP_TO_CORE_TRIG_ERR_STATUS3_DSP_TO_CORE_TRIG_ERR_STATUS_MASK)
/*! @} */

/*! @name DS_GATE_STATUS_REGISTER3 - DSP Output Control */
/*! @{ */

#define DSPSS_DS_GATE_STATUS_REGISTER3_DS_GATE_STATUS_REGISTER_MASK (0x1U)
#define DSPSS_DS_GATE_STATUS_REGISTER3_DS_GATE_STATUS_REGISTER_SHIFT (0U)
#define DSPSS_DS_GATE_STATUS_REGISTER3_DS_GATE_STATUS_REGISTER_WIDTH (1U)
#define DSPSS_DS_GATE_STATUS_REGISTER3_DS_GATE_STATUS_REGISTER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DS_GATE_STATUS_REGISTER3_DS_GATE_STATUS_REGISTER_SHIFT)) & DSPSS_DS_GATE_STATUS_REGISTER3_DS_GATE_STATUS_REGISTER_MASK)
/*! @} */

/*! @name DS_GATE_TRIGMUX_REGISTER3 - DSP Trigger To TRIGMUX */
/*! @{ */

#define DSPSS_DS_GATE_TRIGMUX_REGISTER3_DS_GATE_TRIGMUX_TRIGGER_MASK (0x1U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER3_DS_GATE_TRIGMUX_TRIGGER_SHIFT (0U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER3_DS_GATE_TRIGMUX_TRIGGER_WIDTH (1U)
#define DSPSS_DS_GATE_TRIGMUX_REGISTER3_DS_GATE_TRIGMUX_TRIGGER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DS_GATE_TRIGMUX_REGISTER3_DS_GATE_TRIGMUX_TRIGGER_SHIFT)) & DSPSS_DS_GATE_TRIGMUX_REGISTER3_DS_GATE_TRIGMUX_TRIGGER_MASK)
/*! @} */

/*! @name HW_CTRL_DMA_REQ_STOP3 - Stop DMA Request */
/*! @{ */

#define DSPSS_HW_CTRL_DMA_REQ_STOP3_STOP_MASK    (0x1U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP3_STOP_SHIFT   (0U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP3_STOP_WIDTH   (1U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP3_STOP(x)      (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_STOP3_STOP_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_STOP3_STOP_MASK)
/*! @} */

/*! @name DMA_ERROR_CTRL3 - DMA Error Control */
/*! @{ */

#define DSPSS_DMA_ERROR_CTRL3_DONE_MASK          (0x1U)
#define DSPSS_DMA_ERROR_CTRL3_DONE_SHIFT         (0U)
#define DSPSS_DMA_ERROR_CTRL3_DONE_WIDTH         (1U)
#define DSPSS_DMA_ERROR_CTRL3_DONE(x)            (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_CTRL3_DONE_SHIFT)) & DSPSS_DMA_ERROR_CTRL3_DONE_MASK)
/*! @} */

/*! @name HW_CTRL_DMA_REQ_RESPONSE3 - Hardware Control Handling for DMA Request And Response */
/*! @{ */

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_START_MASK (0x1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_START_SHIFT (0U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_START_WIDTH (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_START(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_START_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_START_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_MASK (0x1FEU)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_SHIFT (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_WIDTH (8U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_DONE_MASK (0x200U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_DONE_SHIFT (9U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_DONE_WIDTH (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_DONE(x)  (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_DONE_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_DONE_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_PEND_MASK (0x3FC00U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_PEND_SHIFT (10U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_PEND_WIDTH (8U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_PEND(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_PEND_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE3_NUM_OF_DMA_REQ_PEND_MASK)
/*! @} */

/*! @name DSPSS_SOFT_RESET_REGISTER - DSPSS Soft Reset */
/*! @{ */

#define DSPSS_DSPSS_SOFT_RESET_REGISTER_SFTRST_MASK (0x1U)
#define DSPSS_DSPSS_SOFT_RESET_REGISTER_SFTRST_SHIFT (0U)
#define DSPSS_DSPSS_SOFT_RESET_REGISTER_SFTRST_WIDTH (1U)
#define DSPSS_DSPSS_SOFT_RESET_REGISTER_SFTRST(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_SOFT_RESET_REGISTER_SFTRST_SHIFT)) & DSPSS_DSPSS_SOFT_RESET_REGISTER_SFTRST_MASK)
/*! @} */

