rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_SDADC_SYNC_FIFO_OVERFLOW_IE_MASK (0xFU)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_SDADC_SYNC_FIFO_OVERFLOW_IE_SHIFT (0U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_SDADC_SYNC_FIFO_OVERFLOW_IE_WIDTH (4U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_SDADC_SYNC_FIFO_OVERFLOW_IE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER2_SDADC_SYNC_FIFO_OVERFLOW_IE_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER2_SDADC_SYNC_FIFO_OVERFLOW_IE_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_OVERFLOW_IE_MASK (0xF00U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_OVERFLOW_IE_SHIFT (8U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_OVERFLOW_IE_WIDTH (4U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_OVERFLOW_IE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_OVERFLOW_IE_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_OVERFLOW_IE_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_UNDERRUN_IE_MASK (0xF000U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_UNDERRUN_IE_SHIFT (12U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_UNDERRUN_IE_WIDTH (4U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_UNDERRUN_IE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_UNDERRUN_IE_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_CORE_BUFFER_UNDERRUN_IE_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_ACK_TIMEOUT_ERR_IE_MASK (0x10000U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_ACK_TIMEOUT_ERR_IE_SHIFT (16U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_ACK_TIMEOUT_ERR_IE_WIDTH (1U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_ACK_TIMEOUT_ERR_IE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_ACK_TIMEOUT_ERR_IE_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_ACK_TIMEOUT_ERR_IE_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_FIFO_ERR_IE_EN_MASK (0x20000U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_FIFO_ERR_IE_EN_SHIFT (17U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_FIFO_ERR_IE_EN_WIDTH (1U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_FIFO_ERR_IE_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_FIFO_ERR_IE_EN_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_FIFO_ERR_IE_EN_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_INIT_LOW_IE_MASK (0x40000U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_INIT_LOW_IE_SHIFT (18U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_INIT_LOW_IE_WIDTH (1U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_INIT_LOW_IE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_INIT_LOW_IE_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER2_DSP_INIT_LOW_IE_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_ACC_FIFO_THRESHOLD_CROSS_INT_EN_MASK (0x80000U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_ACC_FIFO_THRESHOLD_CROSS_INT_EN_SHIFT (19U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_ACC_FIFO_THRESHOLD_CROSS_INT_EN_WIDTH (1U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_ACC_FIFO_THRESHOLD_CROSS_INT_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_ACC_FIFO_THRESHOLD_CROSS_INT_EN_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER2_REQ_ACC_FIFO_THRESHOLD_CROSS_INT_EN_MASK)
/*! @} */

/*! @name SDADC_SYNC_FIFO_ERROR_STATUS - FIFO Overflow Status */
/*! @{ */

#define DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_OVERFLOW_MASK (0xFU)
#define DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_OVERFLOW_SHIFT (0U)
#define DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_OVERFLOW_WIDTH (4U)
#define DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_OVERFLOW(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_OVERFLOW_SHIFT)) & DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_OVERFLOW_MASK)

#define DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_REQ_FIFO_OVERFLOW_MASK (0x100U)
#define DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_REQ_FIFO_OVERFLOW_SHIFT (8U)
#define DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_REQ_FIFO_OVERFLOW_WIDTH (1U)
#define DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_REQ_FIFO_OVERFLOW(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_REQ_FIFO_OVERFLOW_SHIFT)) & DSPSS_SDADC_SYNC_FIFO_ERROR_STATUS_REQ_FIFO_OVERFLOW_MASK)
/*! @} */

/*! @name DSP_CORE_BUFFER_CFG - Configuration For DSP-Core Buffer */
/*! @{ */

#define DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_EN_MASK (0xFU)
#define DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_EN_SHIFT (0U)
#define DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_EN_WIDTH (4U)
#define DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_EN_SHIFT)) & DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_EN_MASK)

#define DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_MASTER_MASK (0xF0U)
#define DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_MASTER_SHIFT (4U)
#define DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_MASTER_WIDTH (4U)
#define DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_MASTER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_MASTER_SHIFT)) & DSPSS_DSP_CORE_BUFFER_CFG_DSP_CORE_BUFFER_MASTER_MASK)
/*! @} */

/*! @name DMA_BUFFER_CFG - DMA Buffer Configuration */
/*! @{ */

#define DSPSS_DMA_BUFFER_CFG_DMA_WRITE_EN_MASK   (0x3FU)
#define DSPSS_DMA_BUFFER_CFG_DMA_WRITE_EN_SHIFT  (0U)
#define DSPSS_DMA_BUFFER_CFG_DMA_WRITE_EN_WIDTH  (6U)
#define DSPSS_DMA_BUFFER_CFG_DMA_WRITE_EN(x)     (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_BUFFER_CFG_DMA_WRITE_EN_SHIFT)) & DSPSS_DMA_BUFFER_CFG_DMA_WRITE_EN_MASK)

#define DSPSS_DMA_BUFFER_CFG_DMA_READ_EN_MASK    (0xFC0U)
#define DSPSS_DMA_BUFFER_CFG_DMA_READ_EN_SHIFT   (6U)
#define DSPSS_DMA_BUFFER_CFG_DMA_READ_EN_WIDTH   (6U)
#define DSPSS_DMA_BUFFER_CFG_DMA_READ_EN(x)      (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_BUFFER_CFG_DMA_READ_EN_SHIFT)) & DSPSS_DMA_BUFFER_CFG_DMA_READ_EN_MASK)

#define DSPSS_DMA_BUFFER_CFG_MAP_XFR_DMA_ERR_ON_IPS_MASK (0x80000000U)
#define DSPSS_DMA_BUFFER_CFG_MAP_XFR_DMA_ERR_ON_IPS_SHIFT (31U)
#define DSPSS_DMA_BUFFER_CFG_MAP_XFR_DMA_ERR_ON_IPS_WIDTH (1U)
#define DSPSS_DMA_BUFFER_CFG_MAP_XFR_DMA_ERR_ON_IPS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_BUFFER_CFG_MAP_XFR_DMA_ERR_ON_IPS_SHIFT)) & DSPSS_DMA_BUFFER_CFG_MAP_XFR_DMA_ERR_ON_IPS_MASK)
/*! @} */

/*! @name SCHEDULER_MODE_CFG - Thread Scheduling Mode Selection */
/*! @{ */

