rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
#define DSPSS_SCHEDULER_MODE_CFG_SCHEDULER_MODE_MASK (0x3U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHEDULER_MODE_SHIFT (0U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHEDULER_MODE_WIDTH (2U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHEDULER_MODE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_SCHEDULER_MODE_CFG_SCHEDULER_MODE_SHIFT)) & DSPSS_SCHEDULER_MODE_CFG_SCHEDULER_MODE_MASK)

#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_1_MASK (0x3CU)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_1_SHIFT (2U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_1_WIDTH (4U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_1(x)   (((uint32_t)(((uint32_t)(x)) << DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_1_SHIFT)) & DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_1_MASK)

#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_2_MASK (0x3C0U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_2_SHIFT (6U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_2_WIDTH (4U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_2(x)   (((uint32_t)(((uint32_t)(x)) << DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_2_SHIFT)) & DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_2_MASK)

#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_3_MASK (0x3C00U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_3_SHIFT (10U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_3_WIDTH (4U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_3(x)   (((uint32_t)(((uint32_t)(x)) << DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_3_SHIFT)) & DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_3_MASK)

#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_4_MASK (0x3C000U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_4_SHIFT (14U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_4_WIDTH (4U)
#define DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_4(x)   (((uint32_t)(((uint32_t)(x)) << DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_4_SHIFT)) & DSPSS_SCHEDULER_MODE_CFG_SCHD_SEQ_4_MASK)

#define DSPSS_SCHEDULER_MODE_CFG_NEXT_REQ_HALT_ACK_WAIT_CTRL_MASK (0x40000U)
#define DSPSS_SCHEDULER_MODE_CFG_NEXT_REQ_HALT_ACK_WAIT_CTRL_SHIFT (18U)
#define DSPSS_SCHEDULER_MODE_CFG_NEXT_REQ_HALT_ACK_WAIT_CTRL_WIDTH (1U)
#define DSPSS_SCHEDULER_MODE_CFG_NEXT_REQ_HALT_ACK_WAIT_CTRL(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_SCHEDULER_MODE_CFG_NEXT_REQ_HALT_ACK_WAIT_CTRL_SHIFT)) & DSPSS_SCHEDULER_MODE_CFG_NEXT_REQ_HALT_ACK_WAIT_CTRL_MASK)
/*! @} */

/*! @name DSPSS_DSP0_CFG - DSP0 Reset And Core Trigger Configuration */
/*! @{ */

#define DSPSS_DSPSS_DSP0_CFG_SCHED_DSP_RST_CTRL_EN_MASK (0x1U)
#define DSPSS_DSPSS_DSP0_CFG_SCHED_DSP_RST_CTRL_EN_SHIFT (0U)
#define DSPSS_DSPSS_DSP0_CFG_SCHED_DSP_RST_CTRL_EN_WIDTH (1U)
#define DSPSS_DSPSS_DSP0_CFG_SCHED_DSP_RST_CTRL_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP0_CFG_SCHED_DSP_RST_CTRL_EN_SHIFT)) & DSPSS_DSPSS_DSP0_CFG_SCHED_DSP_RST_CTRL_EN_MASK)

#define DSPSS_DSPSS_DSP0_CFG_dspss_scheduler_dsp0_reset_MASK (0x2U)
#define DSPSS_DSPSS_DSP0_CFG_dspss_scheduler_dsp0_reset_SHIFT (1U)
#define DSPSS_DSPSS_DSP0_CFG_dspss_scheduler_dsp0_reset_WIDTH (1U)
#define DSPSS_DSPSS_DSP0_CFG_dspss_scheduler_dsp0_reset(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP0_CFG_dspss_scheduler_dsp0_reset_SHIFT)) & DSPSS_DSPSS_DSP0_CFG_dspss_scheduler_dsp0_reset_MASK)

#define DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_cfg_MASK (0xCU)
#define DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_cfg_SHIFT (2U)
#define DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_cfg_WIDTH (2U)
#define DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_cfg(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_cfg_SHIFT)) & DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_cfg_MASK)

#define DSPSS_DSPSS_DSP0_CFG_XMEM_CTRL_PRIORITY_MASK (0x10U)
#define DSPSS_DSPSS_DSP0_CFG_XMEM_CTRL_PRIORITY_SHIFT (4U)
#define DSPSS_DSPSS_DSP0_CFG_XMEM_CTRL_PRIORITY_WIDTH (1U)
#define DSPSS_DSPSS_DSP0_CFG_XMEM_CTRL_PRIORITY(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP0_CFG_XMEM_CTRL_PRIORITY_SHIFT)) & DSPSS_DSPSS_DSP0_CFG_XMEM_CTRL_PRIORITY_MASK)

#define DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_safety_cfg_MASK (0x180U)
#define DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_safety_cfg_SHIFT (7U)
#define DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_safety_cfg_WIDTH (2U)
#define DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_safety_cfg(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_safety_cfg_SHIFT)) & DSPSS_DSPSS_DSP0_CFG_dspss_dsp0_core_trigger_safety_cfg_MASK)
/*! @} */

/*! @name INTERRUPT_ENABLE_REGISTER - Interrupt Enable */
/*! @{ */

#define DSPSS_INTERRUPT_ENABLE_REGISTER_DSP_ERROR_INTR_EN_MASK (0xFU)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DSP_ERROR_INTR_EN_SHIFT (0U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DSP_ERROR_INTR_EN_WIDTH (4U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DSP_ERROR_INTR_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER_DSP_ERROR_INTR_EN_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER_DSP_ERROR_INTR_EN_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_ERR_INTR_EN_MASK (0x3F0U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_ERR_INTR_EN_SHIFT (4U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_ERR_INTR_EN_WIDTH (6U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_ERR_INTR_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_ERR_INTR_EN_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_ERR_INTR_EN_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_ERR_INTR_EN_MASK (0xFC00U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_ERR_INTR_EN_SHIFT (10U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_ERR_INTR_EN_WIDTH (6U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_ERR_INTR_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_ERR_INTR_EN_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_ERR_INTR_EN_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_XFR_ERR_INTR_EN_MASK (0x3F0000U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_XFR_ERR_INTR_EN_SHIFT (16U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_XFR_ERR_INTR_EN_WIDTH (6U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_XFR_ERR_INTR_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_XFR_ERR_INTR_EN_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_WRITE_BUFFER_XFR_ERR_INTR_EN_MASK)

#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_XFR_ERR_INTR_EN_MASK (0xFC00000U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_XFR_ERR_INTR_EN_SHIFT (22U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_XFR_ERR_INTR_EN_WIDTH (6U)
#define DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_XFR_ERR_INTR_EN(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_XFR_ERR_INTR_EN_SHIFT)) & DSPSS_INTERRUPT_ENABLE_REGISTER_DMA_READ_BUFFER_XFR_ERR_INTR_EN_MASK)
/*! @} */

/*! @name DSPSS_DSP_IO_INTF0 - DSP Trigger to Core */
/*! @{ */

