rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DSPSS.h
/*! @name DMA_ERROR_STATUS5 - DMA Error Status */
/*! @{ */

#define DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_WR_BUFFER_MASK (0x1U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT (0U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_WR_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_WR_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_WR_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_WR_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_RD_BUFFER_MASK (0x2U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT (1U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_RD_BUFFER_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_RD_BUFFER(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_RD_BUFFER_SHIFT)) & DSPSS_DMA_ERROR_STATUS5_DMA_ADDR_MISMATCH_RD_BUFFER_MASK)

#define DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_WRITE_MASK (0x4U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_WRITE_SHIFT (2U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_WRITE_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_WRITE(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_WRITE_SHIFT)) & DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_WRITE_MASK)

#define DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_READ_MASK (0x8U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_READ_SHIFT (3U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_READ_WIDTH (1U)
#define DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_READ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_READ_SHIFT)) & DSPSS_DMA_ERROR_STATUS5_DMA_XFR_ERR_READ_MASK)
/*! @} */

/*! @name DMA_WRITE_ADDR5 - Reference DMA Write Region */
/*! @{ */

#define DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_START_ADDR_MASK (0x3FFFU)
#define DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_START_ADDR_SHIFT (0U)
#define DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_START_ADDR_WIDTH (14U)
#define DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_START_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_START_ADDR_SHIFT)) & DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_START_ADDR_MASK)

#define DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_END_ADDR_MASK (0xFFFC0000U)
#define DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_END_ADDR_SHIFT (18U)
#define DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_END_ADDR_WIDTH (14U)
#define DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_END_ADDR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_END_ADDR_SHIFT)) & DSPSS_DMA_WRITE_ADDR5_DMA_WRITE_END_ADDR_MASK)
/*! @} */

/*! @name DMA_CURR_WR_PTR5 - DMA Current Write Pointer */
/*! @{ */

#define DSPSS_DMA_CURR_WR_PTR5_DMA_CURR_WRITE_PTR_MASK (0x3FFFU)
#define DSPSS_DMA_CURR_WR_PTR5_DMA_CURR_WRITE_PTR_SHIFT (0U)
#define DSPSS_DMA_CURR_WR_PTR5_DMA_CURR_WRITE_PTR_WIDTH (14U)
#define DSPSS_DMA_CURR_WR_PTR5_DMA_CURR_WRITE_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_WR_PTR5_DMA_CURR_WRITE_PTR_SHIFT)) & DSPSS_DMA_CURR_WR_PTR5_DMA_CURR_WRITE_PTR_MASK)

#define DSPSS_DMA_CURR_WR_PTR5_DMA_WRITE_PTR_WRAP_MASK (0x80000000U)
#define DSPSS_DMA_CURR_WR_PTR5_DMA_WRITE_PTR_WRAP_SHIFT (31U)
#define DSPSS_DMA_CURR_WR_PTR5_DMA_WRITE_PTR_WRAP_WIDTH (1U)
#define DSPSS_DMA_CURR_WR_PTR5_DMA_WRITE_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_WR_PTR5_DMA_WRITE_PTR_WRAP_SHIFT)) & DSPSS_DMA_CURR_WR_PTR5_DMA_WRITE_PTR_WRAP_MASK)
/*! @} */

/*! @name DMA_CURR_RD_PTR5 - DMA Current Read Pointer */
/*! @{ */

#define DSPSS_DMA_CURR_RD_PTR5_DMA_CURR_READ_PTR_MASK (0x3FFFU)
#define DSPSS_DMA_CURR_RD_PTR5_DMA_CURR_READ_PTR_SHIFT (0U)
#define DSPSS_DMA_CURR_RD_PTR5_DMA_CURR_READ_PTR_WIDTH (14U)
#define DSPSS_DMA_CURR_RD_PTR5_DMA_CURR_READ_PTR(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_RD_PTR5_DMA_CURR_READ_PTR_SHIFT)) & DSPSS_DMA_CURR_RD_PTR5_DMA_CURR_READ_PTR_MASK)

#define DSPSS_DMA_CURR_RD_PTR5_DMA_READ_PTR_WRAP_MASK (0x80000000U)
#define DSPSS_DMA_CURR_RD_PTR5_DMA_READ_PTR_WRAP_SHIFT (31U)
#define DSPSS_DMA_CURR_RD_PTR5_DMA_READ_PTR_WRAP_WIDTH (1U)
#define DSPSS_DMA_CURR_RD_PTR5_DMA_READ_PTR_WRAP(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_CURR_RD_PTR5_DMA_READ_PTR_WRAP_SHIFT)) & DSPSS_DMA_CURR_RD_PTR5_DMA_READ_PTR_WRAP_MASK)
/*! @} */

/*! @name DSP_TO_DMA_REQUEST_STATUS5 - DMA Request Status */
/*! @{ */

#define DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DSP_TO_DMA_REQUEST_STATUS_MASK (0x1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DSP_TO_DMA_REQUEST_STATUS_SHIFT (0U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DSP_TO_DMA_REQUEST_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DSP_TO_DMA_REQUEST_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DSP_TO_DMA_REQUEST_STATUS_SHIFT)) & DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DSP_TO_DMA_REQUEST_STATUS_MASK)

#define DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DMA_TO_DSP_ACK_STATUS_MASK (0x2U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DMA_TO_DSP_ACK_STATUS_SHIFT (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DMA_TO_DSP_ACK_STATUS_WIDTH (1U)
#define DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DMA_TO_DSP_ACK_STATUS(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DMA_TO_DSP_ACK_STATUS_SHIFT)) & DSPSS_DSP_TO_DMA_REQUEST_STATUS5_DMA_TO_DSP_ACK_STATUS_MASK)
/*! @} */

/*! @name HW_CTRL_DMA_REQ_STOP5 - Stop DMA Request */
/*! @{ */

#define DSPSS_HW_CTRL_DMA_REQ_STOP5_STOP_MASK    (0x1U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP5_STOP_SHIFT   (0U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP5_STOP_WIDTH   (1U)
#define DSPSS_HW_CTRL_DMA_REQ_STOP5_STOP(x)      (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_STOP5_STOP_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_STOP5_STOP_MASK)
/*! @} */

/*! @name DMA_ERROR_CTRL5 - DMA Error Control */
/*! @{ */

#define DSPSS_DMA_ERROR_CTRL5_DONE_MASK          (0x1U)
#define DSPSS_DMA_ERROR_CTRL5_DONE_SHIFT         (0U)
#define DSPSS_DMA_ERROR_CTRL5_DONE_WIDTH         (1U)
#define DSPSS_DMA_ERROR_CTRL5_DONE(x)            (((uint32_t)(((uint32_t)(x)) << DSPSS_DMA_ERROR_CTRL5_DONE_SHIFT)) & DSPSS_DMA_ERROR_CTRL5_DONE_MASK)
/*! @} */

/*! @name HW_CTRL_DMA_REQ_RESPONSE5 - Hardware Control Handling for DMA Request And Response */
/*! @{ */

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_START_MASK (0x1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_START_SHIFT (0U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_START_WIDTH (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_START(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_START_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_START_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_MASK (0x1FEU)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_SHIFT (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_WIDTH (8U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ(x) (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_NUM_OF_DMA_REQ_MASK)

#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_DONE_MASK (0x200U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_DONE_SHIFT (9U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_DONE_WIDTH (1U)
#define DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_DONE(x)  (((uint32_t)(((uint32_t)(x)) << DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_DONE_SHIFT)) & DSPSS_HW_CTRL_DMA_REQ_RESPONSE5_DONE_MASK)

